[
	{
		"UUID": "04d1a141-3585-4eda-81cd-184b0d6b0f8b",
		"timeposted": 1720020467,
		"title": "A cool start to a blog site!",
		"content": [
			{
				"heading": "What this site will be",
				"content": "This site will be my attempt at organizing all of my projects and to show it off to people easly. Essentually a digital portfolio of sorts."
			},
			{
				"heading": "When things will happen",
				"content": "As I bounce between projects and find myself busy in life, I am aiming to be completing more projects by the end of this month. This website just happens to be one of mine. I really want to try to be a part of Pirate Software's game jam on July 17th, but I know imma have 2 days of downtime on that day. Lets see what I can do, even if I don't make the time frame."
			}
		]
	},
	{
		"UUID": "8bd4b9f2-5ee9-462e-9f89-556adcac9f33",
		"timeposted": 1720091853,
		"title": "Freedom day!",
		"content": [
			{
				"heading": "Happy 4th of July!",
				"content": "Todays the freedom day! Gonna relax, clear my thoughts, and celibrate independence day!"
			},
			{
				"heading": "Practicing my independence",
				"content": "Just going to spend the next couple of days not hooked into making things or being busy. I definitly need it because I have massive goals that take heavy thought into how I spend my time."
			}
		]
	},
	{
		"UUID": "238c2c80-cea3-48c6-9a32-a08cc2d2db10",
		"timeposted": 1720103815,
		"title": "Messing with golang",
		"content": [
			{
				"heading": "Inital thoughts",
				"content": "I loved the fact that GoLang could export to a executable binary, so I wanted to learn it. However, I kept on getting too technical with it and end up not making anything I wanted."
			},
			{
				"heading": "Technical stuff",
				"content": "I would make my code as explicit as possable, as low level as possable, and overall not making anything because I would get myself stuck on something that wouldn't help me make anything. With making a post editor and just generally coding for this website, I have learned to take a step back and build what I need to build first, then make the code better later."
			},
			{
				"heading": "Conclusion",
				"content": "Tldr: Focus on making something with code, then optimizing later. Keep it simple and stupid. Don't worry about not repeating yourself, fix it later."
			}
		]
	}
]